# Pandas Groupby

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOG'] * 2 + ['MSFT'] * 2 + ['FB'] * 2,
       'Person': ['Sam', 'Dean', 'Castiel', 'Crowly', 'Chuck', 'Jack'],
       'Sales': [200, 143, 340, 124, 243, 350]}

In [3]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Dean', 'Castiel', 'Crowly', 'Chuck', 'Jack'],
 'Sales': [200, 143, 340, 124, 243, 350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG     Dean    143
2    MSFT  Castiel    340
3    MSFT   Crowly    124
4      FB    Chuck    243
5      FB     Jack    350

In [6]:
df.groupby('Company')

In [7]:
by_comp = df.groupby('Company')

In [8]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     171.5
MSFT     232.0

In [9]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       343
MSFT       464

In [10]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      40.305087
MSFT     152.735065

In [11]:
by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [12]:
df.groupby('Company').std().loc['MSFT']

Sales    152.735065
Name: MSFT, dtype: float64

In [13]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [14]:
df.groupby('Company').max()

         Person  Sales
Company
FB         Jack    350
GOOG        Sam    200
MSFT     Crowly    340

In [15]:
df.groupby('Company').min()

          Person  Sales
Company
FB         Chuck    243
GOOG        Dean    143
MSFT     Castiel    124

In [16]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  171.5   40.305087  143.0  157.25  171.5  185.75  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [17]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  171.500000  232.000000
      std     75.660426   40.305087  152.735065
      min    243.000000  143.000000  124.000000
      25%    269.750000  157.250000  178.000000
      50%    296.500000  171.500000  232.000000
      75%    323.250000  185.750000  286.000000
      max    350.000000  200.000000  340.000000